[
  {
    "id": 13,
    "title": "Boiling",
    "description": "Introduction: Boiling is one of the healthiest and cleanest ways to cook. Boiled dishes are typically easier to digest and lower in fat. And they can still taste delicious!\r\n\r\nSafety measures and good practices: Make sure the pot fits all the food you want to cook, and fill water enough to cover the food. Try to ensure 5cm space left between the surface of water and the top of the pot.\r\n\r\nTip 1: Remember when we said salt is a chef’s best friend? Add a lot of salt to your water when you boil it; it needs to taste like sea salt. However, it is a myth that salt water boils faster: salt water heats up faster but also has a higher boiling point temperature, hence it does not boil faster.\r\n\r\nUsage 1: What dish comes to mind when you think of boiling water? Pasta! Remember to add salt & olive oil before boiling. And to prevent the pot from boiling over, try adding a wooden spatula over the pot, the texture of the wood often causes bubbles to burst and helps to remind you to turn the heat down!\r\n\r\nUsage 2: Before we get into straining, you may want to save some of the water that you boiled with your food. Whether it’s pasta water, chicken stock or vegetable stock, it can be a great addition to your dishes later on.\r\n\r\nTip 2: Lastly, let’s talk about draining the water. One hack for this is to put your colander directly into the pot of water, then pouring directly into a sink with the colander still in the pot. That way you don’t have to aim into the strainer in your sink or make sure it doesn’t tip spill in the sink. (Reference) If you dont have a colander, often lids can be used instead.",
    "lesson_id": 4,
    "created_at": "2021-03-13T17:53:28.374Z",
    "updated_at": "2021-04-05T18:51:21.916Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1617648414/Cuukin%20-%20Skill%20Videos/skillchapter_boiling_lhhooh.mp4",
    "badge_id": 38,
    "poster_url": null
  },
  {
    "id": 12,
    "title": "Dried pasta",
    "description": "Introduction: Ask anyone from anywhere what their favorite type of food is, pasta will be in the conversation. In this video we’re going to provide some useful tips on picking the perfect pasta and cooking it the right way. Keep an eye out for specific recipes in our Cuuk Books.\r\n\r\nUsage 1: There are over 500 shapes of pasta. Let’s make it easy to pick the right pasta, ultimately it depends on your sauce. For meat sauces (like ragus or bolognese) think tubes pastas like rigatoni or paccheri. For lighter sauces (like pomodoro, arrabiata, or vongole) think rod pastas like spaghetti, angel hair, or bucatini. For creamy or cheesier sauces, shaped pastas with a work best to gather the sauce (orecchiette, penne, farfalle).\r\n\r\nUsage 2: People often don’t know how much pasta to make and end up dumping in the whole box. There’s a better approach to measuring the right quantity without a scale.For rod pastas you want 55 grams per person. Hold a bunch in a circle between your thumb and index finger and it should fit perfectly into the opening of a soda bottle or the size of a sterling coin, that’s your 55 grams.For shorter shaped pastas you want roughly 2/3rds of a cup per person. You can eyeball it as a hand or palmful of pasta per person.\r\n\r\nGood practice 1: Make sure your water is boiling before you add the pasta. Before putting any pasta in boiling water, add salt to the water for flavor.\r\n\r\nGood practice 2: Don’t break the pasta to fit it into your bowl, its meant to be the size it is! You can move it around to help submerge it instead.\r\n\r\nTip: You want to cook dried pasta to “al dente”, in plain English meaning “firm to the bite”. This usually translates to 9-10 minutes of boiling but follow the instructions on the package.",
    "lesson_id": 4,
    "created_at": "2021-03-13T17:53:28.365Z",
    "updated_at": "2021-04-05T18:48:05.552Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1617648404/Cuukin%20-%20Skill%20Videos/skillchapter_driedpasta_x7o0dm.mp4",
    "badge_id": 23,
    "poster_url": null
  },
  {
    "id": 11,
    "title": "Frying pan",
    "description": "Introduction: There are many types of frying pans: stainless steel, cast iron, non-stick. Non-stick pan might be the best option for a beginner to get started. Make sure to check if your stove is induction based or not and get a pan that works on it.\r\n\r\nSafety measures and good practices: Non-stick pans have a coating that allows food to brown without sticking to the pan.. To maintain the coating, only use silicon or wooden mixing tools (never use metal).\r\n      \r\nUsage 1: Always warm up fat on the pan before cooking, as that further keeps food from sticking to the pan. For oils, it is also important to warm up the pan before adding it. You can use less oil or butter on non-stick pans.\r\n\r\nUsage 2: You can use frying pans to stir fry veggies, sautee meat, or fry eggs quickly and conveniently. Preparing food in a frying pan is generally faster than boiling (e.g. broccoli boiling takes ~7min vs stir frying ~4min) and significantly faster than baking.",
    "lesson_id": 4,
    "created_at": "2021-03-13T17:53:28.357Z",
    "updated_at": "2021-04-05T18:52:13.007Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1616693109/Cuukin%20-%20Skill%20Videos/skillchapter_frying_pan_jyon0q.mp4",
    "badge_id": 26,
    "poster_url": null
  },
  {
    "id": 10,
    "title": "Stove",
    "description": "Introduction: Induction, gas or electric. If you can master any of those stove, you can cook amazing dishes.\r\n\r\nUsage 1: Stove produces a constant amount of heat over time, so the temperature of your pan will increase over time if left alone. The challenge is that when we cook we need to reach a specific temperature to get a specific result. But don’t worry too much for now. You don’t need to use a thermometer, we will teach you to read all the cues to cook amazing foods.\r\n\r\nUsage 2: Now let’s talk about the different heat levels on your dial. High heat is the quickest method and it is perfect for bringing water to a boil or raising the temperature of pots and pans in anticipation of cooking. Avoid cooking food directly  in high heat as it can burn or char good.\r\n\r\nUsage 3: Medium-High still allows you to cook food quite quickly but not so quickly that food burns or oil starts to smoke. It’s perfect for frying or sauteing.\r\n\r\nUsage 4: Medium Heat allows for a gentler and gradual cook that cooks through your meal.\r\n\r\nUsage 5: Low Heat is perfect for simmering dishes over time like pasta sauces to allow the flavors to condense slowly, and cooking sensible ingredients such as eggs.\r\n\r\nTip 1: As a rule of thumb if you’re unsure of your heat level, have it slightly lower than you think you need to avoid overcooking or charring meals. If you think the pan is too hot, you can drop a splash of water to lower the temperature down.\r\n\r\nSafety: Remember to always turn your stove off after you’re done. Once the heat is gone, clean your stove top with soap and water.",
    "lesson_id": 4,
    "created_at": "2021-03-13T17:53:28.348Z",
    "updated_at": "2021-04-05T18:49:26.422Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1617648373/Cuukin%20-%20Skill%20Videos/skillchapter_stove_npbrtg.mp4",
    "badge_id": 29,
    "poster_url": null
  },
  {
    "id": 9,
    "title": "Egg",
    "description": "Introduction: Eggs are one of the most versatile ingredients. They are perfect in both sweet and savoury dishes, baked goods and even drinks!\r\n\r\nSafety measures and good practices: When buying, look out for cracks or dirty spots in the shell. Always crack in a separate bowl to check if they are bad (they will smell really horrendous). Be careful when eating them raw, make sure they're really fresh or pasteurised. Bad raw eggs can bring serious health issues.\r\n\r\nUsage 1: to crack an egg, just give it one good wack on a flat surface, turn the cracked side up and open it with your thumb.\r\n\r\nUsage 2: To take shells out, dip your finger in water and grab it.\r\n\r\nUsage 3: To separate yolk (fat and protein) from whites (protein and water), wet your hand and gently grab the yolk from the bottom.\r\n\r\nBuying and Storing: Lasts longer in the fridge (up to five weeks) but can be stored in room temperature. Always check the best by date on the package and keep in mind that they taste better fresh.\r\n\r\nComposition tip: Most of the time you should do your eggs slowly and in low heat. Try to take them from the heat right before they finish cooking, so they continue the cooking process with residual heat!",
    "lesson_id": 4,
    "created_at": "2021-03-13T17:53:28.338Z",
    "updated_at": "2021-03-25T17:27:14.979Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1616692980/Cuukin%20-%20Skill%20Videos/skillchapter_egg_f7xlab.mp4",
    "badge_id": 15,
    "poster_url": null
  },
  {
    "id": 8,
    "title": "Baking 1",
    "description": "Introduction: Baking is an oven cooking technique that creates delicious food without making a mess in your kitchen! It can be applied to a wide range of ingredients such as animal proteins, veggies, greens, breads, sweets and much more!\r\n\r\nTechnical info: You can use different temperatures to cook different ingredients and achieve different tastes and textures. Generally speaking, this is what a low heat, a medium-low, a medium-high and high heat means.\r\n\r\nUsage 1: It is a best practice to trust your recipe and follow the indicated oven configuration (type of heating and temperature) for the expected time. If you’re improvising or lost the recipe, go for the heating on top and bottom, at 180ºC, a trusty configuration that cooks your food through with a browned outside.\r\n\r\nUsage 2: Baking requires a somewhat constant temperature, so don’t forget to preheat your oven before baking. Also try not to open the ovens door too many times, since it causes a temperature drop inside the chamber. To know when your food is done you can set a timer, a thermometer (which is optional), check it through the glass or open the oven for a quick glance! ",
    "lesson_id": 3,
    "created_at": "2021-03-13T17:53:28.329Z",
    "updated_at": "2021-04-05T18:55:16.492Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1617648872/Cuukin%20-%20Skill%20Videos/skillchapter_baking1_xksqq0.mp4",
    "badge_id": 37,
    "poster_url": null
  },
  {
    "id": 7,
    "title": "Baking Tray",
    "description": "Introduction: A baking tray (also known as a sheet pan or a baking sheet) is the flat metal sheet perfect for baking or roasting food in your oven.\r\n\r\nTips on Buying: We recommend using a rimmed baking tray, especially for roasting, so the juices don’t overflow off the tray, as well a firm and non stick coated tray.\r\n\r\nUsage 1: Roasted root vegetables (potatoes, carrots, parsnips) are one of the tastiest and simplest dishes to make using a baking tray. Remember when roasted vegetables to generously add oil and to space out the vegetables on the tray rather than stack them on top of each other to ensure they come out crispy.\r\n\r\nTip 1: To help make clean up easier, and avoid sticking to the tray, parchment paper can be placed under your food  to allow it to easily be removed when your cooking is complete.However, if clean-up isn’t on your priority list, roasting potatoes and veg directly on the tray can give them an extra crispy finish.\r\n\r\nUsage 2: The next use for a baking tray is, you guessed it, baking! Baking trays are perfect for making cookies or other pastries as they allow for the perfect distribution of sustained heat.\r\n\r\nWatch out: Always use potholders and oven mitts that are in good condition when removing your hot baking tray as unlike some pots and pans, the entire surface would be extremely hot. If you don’t have them, you can improvise with a folded kitchen towel!",
    "lesson_id": 3,
    "created_at": "2021-03-13T17:53:28.319Z",
    "updated_at": "2021-04-05T18:55:39.521Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1617648905/Cuukin%20-%20Skill%20Videos/skillchapter_bakingtray_npp6ca.mp4",
    "badge_id": 27,
    "poster_url": null
  },
  {
    "id": 6,
    "title": "Oven",
    "description": "Introduction: Even if you’re a beginner you can conquer the oven. Just leave your dish inside, set a timer and let the oven do its job.\r\n\r\nSafety measures and good practices: Use oven-safe cookware and be extra careful when removing your trays from the oven as they are extremely hot.\r\n\r\nUsage 1: Normally, an oven has 2 different heating methods: baking and grilling. Baking heats the food through the air in a controlled temperature, while grilling works through radiation like a barbecue. In most ovens, you can use both methods if needed.\r\n\r\nTip 1:. When a recipe calls for an oven , always start by preheating it. Preheating is important to make sure the cooking time is more precise and that the dish cooks more evenly.\r\n\r\nTip 2: Leave at least 2 inches of space around your cookware to allow the air to circulate properly. Cramming your oven will make your food cook unevenly.\r\n\r\nTip 3: Check if your oven has a fan. Fans are common in modern ovens and they make the air circulate better, keeping an even temperature. If your oven does not have a fan, a good rule of thumb is to increase the temperature by 20ºC.",
    "lesson_id": 3,
    "created_at": "2021-03-13T17:53:28.309Z",
    "updated_at": "2021-04-05T18:56:52.906Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1617648979/Cuukin%20-%20Skill%20Videos/skillchapter_oven_jwgwl3.mp4",
    "badge_id": 29,
    "poster_url": null
  },
  {
    "id": 5,
    "title": "Olive oil",
    "description": "Introduction 1: Olive Oil is a highly versatile ingredient, being the prominent fat of meditaranean cuisine. It serves as a cooking medium, or seasoning depending on the recipe.\r\n\r\nIntroduction 2: Fat, along with Protein and Carbohydrates is one of the main components of food. Despite all the negative press, fat is actually an essential part of cooking, because it brings flavours together.\r\n\r\nSafety measures and good practices: Keep in mind that olive oil can burn and when it does burn, it should not be eaten. Its burning point is between 190–207°C and easily identifiable. If the oil starts smoking, just throw it away and start over.\r\n\r\nUsage 1: When cooking, first heat up your pan or pot, then add the olive oil and wait for it to heat up before adding the main ingredient. You want to hear the “wizz” when you put it.\r\n\r\nUsage 2: Olive Oil can also be used as a seasoning at room temperature, especially in salads.\r\n\r\nBuying and Storing: Olive Oil is like wine: if you do not know anything about it, it all  all tastes the same; once you start getting a feel for it, you’ll notice there is a huge difference between certain types of oil. But for now, keep it simple: buy extra virgin olive oil. Store Olive Oil in a cool, dry cupboard away from light and heat. Olive Oil expires after 18 months, so always check the expiration date of your old Olive Oil bottles.",
    "lesson_id": 3,
    "created_at": "2021-03-13T17:53:28.294Z",
    "updated_at": "2021-03-25T17:26:31.706Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1616692927/Cuukin%20-%20Skill%20Videos/skillchapter_olive_oil_pwpu47.mp4",
    "badge_id": 17,
    "poster_url": null
  },
  {
    "id": 4,
    "title": "Microwaving",
    "description": "Introduction: Microwave works by heating up water using radiation - by far the fastest way to transfer heat. It is great for leftovers or frozen food, but it can also be really helpful when cooking.\r\n\r\nSafety measures and good practices: Never use metal in microwaves as your microwave could potentially catch fire. Glass & ceramic items are the ideal containers. Plastic containers are ok - but check they are microwave safe.\r\n\r\nUsage: Microwave has different settings depending on what you want to do. The standard start button is great for heating up leftovers.Whenever possible, defrost your ingredient naturally by letting it stay 2 to 3 hours at room temperature. However, the microwave is great for urgent defrosting with the defrosting button.The power button allows you to reduce - well - the power to cook more delicate ingredients. For instance, if you are melting chocolate, you need to reduce the power to 50 so you won’t burn it.\r\n\r\nTip 1: If unsure, take a “low & interval” approach: lower power & many 30 second intervals, stirring your food in between.\r\n\r\nTip 2: One use for microwaves is bringing stale bread back to life! Wrap stale bread in a damp (but not soaking) kitchen towel, put it on a plate, and place it in a microwave for 10 seconds. Keep an eye on it and repeat as needed. \r\n\r\nTip 3: Peeling garlic is super easy with a microwave. Using high power, microwave garlic cloves for 20 seconds. Let cool. It should peel super easy. However, this does cook the garlic slightly, so only use in recipes that call for a milder garlic flavor.",
    "lesson_id": 2,
    "created_at": "2021-03-13T17:53:28.281Z",
    "updated_at": "2021-03-25T17:27:57.082Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1616692933/Cuukin%20-%20Skill%20Videos/skillchapter_microwaving_fh2wkj.mp4",
    "badge_id": 39,
    "poster_url": null
  },
  {
    "id": 3,
    "title": "Bread",
    "description": "Introduction: Bread is mainly a combination of flour, water and other optional ingredients that can be traced back to ancient times. Usually high in carbs and fibers, can be used in a million different ways.\r\n\r\nBuying: You can bake your own bread at home, or buy it in the supermarket (which is a lot easier). In your local grocery store you’ll find many different types of bread that you may like: wholewheat, seeded, with grains, baguette, pitta, sourdough... In doubt, go for a simple trusty white loaf.\r\n\r\nUsage 1:  One of the most simple things you can do with bread is a toast! Using a toaster, an oven or even a frying pan! If you want to take it to the next level, add some kind of fat (butter or olive oil) to the outside of the bread to pump up the flavour before toasting it.\r\n\r\nStorage: Bread loses humidity to its surroundings constantly, so make sure to cover it with some cling film, plastic bags or cloth when storing it. You can put them inside for longer storage or outside the fridge for better texture, both works!\r\n\r\nComposition tip: Specific types of bread may have specific uses, but in general it’s up to you. Eat it by itself, dip it in soup, make a sandwich or go for the classic toast with butter and jam!",
    "lesson_id": 5,
    "created_at": "2021-03-13T17:53:28.267Z",
    "updated_at": "2021-05-21T19:40:13.985Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1616692924/Cuukin%20-%20Skill%20Videos/skillchapter_bread_s1b5cs.mp4",
    "badge_id": 23,
    "poster_url": null
  },
  {
    "id": 2,
    "title": "Seasoning 1",
    "description": "Introduction: Seasoning your food is a simple way to take dishes to the next level.  Seasoning works by adding a new layer of taste and aroma to a dish. There are a lot of ingredients which can enhance the flavour of a dish. We have salt, acidic ingredients, spices (pepper, paprika), fresh and dried herbs, and fats.\r\n\r\nTip 1: The taste test as you cook is the best way to know if you’ve seasoned your meal to your liking. Taste frequently, starting with your food unseasoned, then adding different seasoning to the meal, testing it after each one and checking if it needs something else! Trust your tongue!\r\n\r\nUsage 1: Let’s start with lime or lemon juice. Somewhat similar to salt, acid enhances shy, hidden flavours. We have a lot to talk about acid, but for now just notice how often we will squeeze some fresh lemon juice at the end of the recipe.\r\n\r\nUsage 2: Black pepper is often used together with salt. It can be used ground or whole, but if possible grind when seasoning. Preseasoning your proteins ahead of cooking allows for the salt and pepper to be absorbed into the dish, but the cooking process may tame it down so feel free to add it as a final touch as well.\r\n\r\nUsage 3: Herbs are also important to bring aroma and flavour to a dish. As a general rule, prefer using fresh herbs rather than dried herbs, but having dried herbs on your cupboard can be dish-saving.\r\n\r\nTip 2: Herbs can be divided in two groups: hard and soft herbs. Hard herbs such as rosemary should be added at the beginning of the cooking as they give flavour more slowly, while soft herbs such as basil should be added at the end of the cooking to bring freshness.",
    "lesson_id": 1,
    "created_at": "2021-03-13T17:53:28.248Z",
    "updated_at": "2021-03-25T17:29:11.063Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1616693123/Cuukin%20-%20Skill%20Videos/skillchapter_seasoning_xgufz9.mp4",
    "badge_id": 33,
    "poster_url": null
  },
  {
    "id": 1,
    "title": "Salt",
    "description": "Introduction: Salt is a chef’s best friend.  Not only does it have its own unique taste but it also enhances the flavour of other ingredients. Salt not only goes well with savoury food, but it also enhances sweetness, reduces perception of bitterness and balances sourness.\r\n\r\nSafety measures and good practices: If you are cooking for someone with health issues such as high blood pressure, you need to be careful with the  amount of salt you use.\r\n\r\nUsage 1: If you add too little salt, your food will taste bland. If you add too much, your food will taste like sea water. Beginners can sometimes use less salt than they should.\r\n\r\nUsage 2: Each ingredient has a different timing when it comes to adding salt, butit is usually better to add salt before cooking. As a beginner, start with less salt and add more while cooking. Trust your tongue! You will know if it tastes bland and needs more salt.\r\n\r\nUsage 3: The best way to add salt is with your hands, as you can feel how much you are actually adding. You can use your palm as reference, but if you need more precision add a pinch with 2 fingers.\r\n\r\nUsage 4: Important to remember that salt dilutes in water, but it does not dilute in Oil.\r\n\r\nBuying and Storing: For general cooking, buy sea salt, but avoid iodised salt. Iodine gives a metallic taste to food and nowadays you have other safe options for it. You should store in a dry place, away from humidity.",
    "lesson_id": 1,
    "created_at": "2021-03-13T17:53:28.233Z",
    "updated_at": "2021-03-25T17:29:21.593Z",
    "video_url": "https://res.cloudinary.com/juliaf1/video/upload/v1616692963/Cuukin%20-%20Skill%20Videos/skillchapter_salt_vazgbi.mp4",
    "badge_id": 19,
    "poster_url": null
  }
]
